<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
data.github_team.test_team_access: Reading...
data.github_team.operations_engineering_test: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice.module.github-actions.github_repository.default: Preparing import... [id=github-actions]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4DqNZe]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4DqNZb]
data.github_team.operations_engineering_test: Read complete after 2s [id=9456244]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
data.github_team.operations_engineering: Read complete after 2s [id=4192115]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Preparing import... [id=MDEwOlJlcG9zaXRvcnkyMTUwNDI2MTg=:main]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:github-actions]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
data.github_team.test_team_access: Read complete after 5s [id=9472191]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default has changed
  ~ resource "github_branch_protection" "default" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOLPRAVc4DqNZb"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default has changed
  ~ resource "github_branch_protection" "default" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOLRPf2c4DqNZe"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.github-actions.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "github-actions"
    }

  # module.ministryofjustice.module.github-actions.github_branch_protection.default must be replaced
  # (imported from "MDEwOlJlcG9zaXRvcnkyMTUwNDI2MTg=:main")
  # Warning: this will destroy the imported resource
-/+ resource "github_branch_protection" "default" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = true
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDODNFKOs4CwGtk" -> (known after apply)
        lock_branch                     = false
        pattern                         = "main"
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkyMTUwNDI2MTg=" -> "github-actions" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = false
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = true
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = false -> null
        }

      ~ required_status_checks {
          - contexts = [] -> null
            strict   = false
        }
    }

  # module.ministryofjustice.module.github-actions.github_repository.default will be updated in-place
  # (imported from "github-actions")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A collection of reusable GitHub Actions for the Ministry of Justice, designed to streamline and enhance workflows across our projects. • This repository is defined and managed in Terraform"
        etag                        = "W/\"5afb7f0f7f05dba311cce1f080f39f90f6d6a075ad585bf8154f1c58dc99faf9\""
        full_name                   = "ministryofjustice/github-actions"
        git_clone_url               = "git://github.com/ministryofjustice/github-actions.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/github-actions"
        http_clone_url              = "https://github.com/ministryofjustice/github-actions.git"
        id                          = "github-actions"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "github-actions"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMTUwNDI2MTg="
        primary_language            = "Python"
        private                     = false
        repo_id                     = 215042618
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/github-actions.git"
        svn_url                     = "https://github.com/ministryofjustice/github-actions"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "legacy"
            custom_404 = false
            html_url   = "https://ministryofjustice.github.io/github-actions/"
            status     = "built"
            url        = "https://api.github.com/repos/ministryofjustice/github-actions/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"e3e77e7463a777ec9aa2700f03d68221e5a5d61a40ee0532c742f9bb6f8ea228\""
        id         = "4192115:github-actions"
        permission = "admin"
        repository = "github-actions"
        team_id    = "4192115"
    }

Plan: 3 to import, 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```